[3J[H[2J[2K[3J[H[2J[2KPress CTRL+C to start notipy within 9 seconds...
[2K[3J[H[2J[2KPress CTRL+C to start notipy within 8 seconds...
[2K[3J[H[2J[2KPress CTRL+C to start notipy within 7 seconds...
[2K[3J[H[2J[2KPress CTRL+C to start notipy within 6 seconds...
[2K[3J[H[2J[2KPress CTRL+C to start notipy within 5 seconds...
[2K[3J[H[2J[2KPress CTRL+C to start notipy within 4 seconds...
[2K[3J[H[2J[2KPress CTRL+C to start notipy within 3 seconds...
[2K[3J[H[2J[2KPress CTRL+C to start notipy within 2 seconds...
[2K[3J[H[2J[2KPress CTRL+C to start notipy within 1 seconds...
[2K[3J[H[2J[2KPress CTRL+C to start notipy within 0 seconds...
[2K[2KModel: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoder_input (InputLayer)   [(None, 200, 4)]          0         
_________________________________________________________________
reshape (Reshape)            (None, 200, 4, 1)         0         
_________________________________________________________________
conv2d (Conv2D)              (None, 100, 4, 64)        2368      
_________________________________________________________________
batch_normalization (BatchNo (None, 100, 4, 64)        256       
_________________________________________________________________
activation (Activation)      (None, 100, 4, 64)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 50, 2, 32)         49184     
_________________________________________________________________
batch_normalization_1 (Batch (None, 50, 2, 32)         128       
_________________________________________________________________
activation_1 (Activation)    (None, 50, 2, 32)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 25, 1, 16)         3088      
_________________________________________________________________
batch_normalization_2 (Batch (None, 25, 1, 16)         64        
_________________________________________________________________
activation_2 (Activation)    (None, 25, 1, 16)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 25, 1, 8)          392       
_________________________________________________________________
batch_normalization_3 (Batch (None, 25, 1, 8)          32        
_________________________________________________________________
activation_3 (Activation)    (None, 25, 1, 8)          0         
_________________________________________________________________
flatten (Flatten)            (None, 200)               0         
_________________________________________________________________
latent_vector (Dense)        (None, 100)               20100     
=================================================================
Total params: 75,612
Trainable params: 75,372
Non-trainable params: 240
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoder_input (InputLayer)   [(None, 100)]             0         
_________________________________________________________________
dense (Dense)                (None, 200)               20200     
_________________________________________________________________
reshape_1 (Reshape)          (None, 25, 1, 8)          0         
_________________________________________________________________
conv2d_transpose (Conv2DTran (None, 25, 1, 8)          200       
_________________________________________________________________
batch_normalization_4 (Batch (None, 25, 1, 8)          32        
_________________________________________________________________
activation_4 (Activation)    (None, 25, 1, 8)          0         
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 50, 2, 16)         784       
_________________________________________________________________
batch_normalization_5 (Batch (None, 50, 2, 16)         64        
_________________________________________________________________
activation_5 (Activation)    (None, 50, 2, 16)         0         
_________________________________________________________________
conv2d_transpose_2 (Conv2DTr (None, 100, 4, 32)        12320     
_________________________________________________________________
batch_normalization_6 (Batch (None, 100, 4, 32)        128       
_________________________________________________________________
activation_6 (Activation)    (None, 100, 4, 32)        0         
_________________________________________________________________
conv2d_transpose_3 (Conv2DTr (None, 200, 4, 64)        73792     
_________________________________________________________________
batch_normalization_7 (Batch (None, 200, 4, 64)        256       
_________________________________________________________________
activation_7 (Activation)    (None, 200, 4, 64)        0         
_________________________________________________________________
decoder_output (Conv2DTransp (None, 200, 4, 1)         2305      
_________________________________________________________________
reshape_2 (Reshape)          (None, 200, 4)            0         
=================================================================
Total params: 110,081
Trainable params: 109,841
Non-trainable params: 240
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoder_input (InputLayer)   [(None, 200, 4)]          0         
_________________________________________________________________
encoder (Model)              (None, 100)               75612     
_________________________________________________________________
decoder (Model)              (None, 200, 4)            110081    
=================================================================
Total params: 185,693
Trainable params: 185,213
Non-trainable params: 480
_________________________________________________________________
Old Weights loaded from best_small_model.hdf5
Loading cache at ./cache/build_dataset/195e4115b26c44b488fc638fc4faf33eacdbf73b464f3c0d1d218fe8316a3b08.pkl
Epoch 1/1000
