Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 201, 4)]          0         
_________________________________________________________________
reshape (Reshape)            (None, 201, 4, 1)         0         
_________________________________________________________________
conv2d (Conv2D)              (None, 192, 3, 32)        672       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 183, 2, 64)        41024     
_________________________________________________________________
batch_normalization (BatchNo (None, 183, 2, 64)        256       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 174, 2, 32)        20512     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 165, 2, 16)        5136      
_________________________________________________________________
batch_normalization_1 (Batch (None, 165, 2, 16)        64        
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 41, 2, 16)         0         
_________________________________________________________________
flatten (Flatten)            (None, 1312)              0         
_________________________________________________________________
dense (Dense)                (None, 32)                42016     
_________________________________________________________________
dense_1 (Dense)              (None, 32)                1056      
_________________________________________________________________
dense_2 (Dense)              (None, 4)                 132       
=================================================================
Total params: 110,868
Trainable params: 110,708
Non-trainable params: 160
____________________________________

Epoch 101/1000
878/877 [==============================] - 279s 318ms/step - loss: 1.1294 - categorical_accuracy: 0.4685 - val_loss: 1.1157 - val_categorical_accuracy: 0.4769
